print("""你进入了一个黑暗的有两扇门的房间。
你想进入那个扇 #1或者 #2？""")

门 = input("> ")

if 门 == "1":
	print("这里有一只大熊在吃奶酪蛋糕。")
	print("你要做什么？")
	print("1. 拿走这个蛋糕")
	print("2. 对这只熊尖叫")

	熊 = input("> ")

	if 熊 == "1":
		print("这只熊吃掉了你的脸。干得好！")
	elif 熊 == "2":
		print("这只熊吃掉了你的腿。干得好！")
	else:
		print(f"真棒，做{熊}这件事好像更好.")
		print("熊逃走了。")

elif 门 == "2":
	print("你凝视着Cthulhu的视网膜上无尽的深渊。")
	print("1. 蓝莓。")
	print("2. 黄色的夹克衣夹。")
	print("3. 理解左轮手枪的旋律。")

	精神病 = input("> ")

	if 精神病 == "1" or 精神病 == "2":
		print("你的身体在果冻的头脑中生存。")
		print("干得漂亮！")

	else:
		print("精神病把你的眼睛腐蚀成一堆淤泥。")
		print("干得漂亮！")

else:
	print("你蹒跚的摔倒在了刀上死去了。真棒！")
